[
  {"field":"StartOnlineApp","fullName":"Application Start Date","message":"Start %SCHOOL%'s application %DATE%","detail":"This is the date you should log into the online application system for this school and create a user, fill in your basic information and get your application started.","formula":"90"},
  {"field":"SATRegistrationDate","fullName":"SAT Registration Date","message":"Register for the SAT by %DATE%","detail":"The SAT can cause a lot of stress. Minimize your stress levels by taking the SAT early. That way if you need to take it again, you'll have time.","formula":"90"},
  {"field":"LatestSAT","fullName":"Latest SAT Registration Date","message":"You should register for the SAT at the latest, by %DATE%","detail":"The schools need time to receive your SAT scores. If you register any later than %LatestSAT% there's a large chance that your schools won't get your scores by the submission date","formula":"90"},
  {"field":"ACTRegistration","fullName":"ACT Registration Date","message":"Register for the ACT by %DATE%","detail":"The ACT can cause a lot of stress. Minimize your stress levels by taking the ACTsearly. That way if you need to take it again, you'll have time.","formula":"90"},
  {"field":"LatestACT","fullName":"Latest ACT Registration Date","message":"You should register for the SAT at the latest, by %DATE%","detail":"The schools need time to receive your ACT scores. If you register any later than %LatestACT% there's a large chance that your schools won't get your scores by the submission date","formula":"90"},
  {"field":"DownloadSchoolForm","fullName":"Download School Forms","message":"Download the blank school forms and give them to your counselor by %DATE%. If you're using an online application, encourage your counselor to login by this date.","detail":"Either print the recommendation form from online apps or give your recommenders directions on how to get into the online app so they can start your recommendation.","formula":"60"},
  {"field":"DownloadRecForms","fullName":"Download Recommendation Forms","message":"Download the blank receommendation forms and give them to your recommenders by %DATE%. If you're using an online application, encourage your recommender to login by this date.","detail":"Either print the recommendation form from online apps or give your recommenders directions on how to get into the online app so they can start your recommendation.","formula":"60"},
  {"field":"NotifyCounselor","fullName":"Notify Counselor","message":"Ask your high school counselorsto fill out a transcript and recommendation form.","detail":"This is a good safe date to let your counselors know that ","formula":"60"},
  {"field":"NotifyRecommenders","fullName":"Notify Recommenders ","message":"Figure out who can be your recommender and ask them by %DATE%","detail":"Generally you want to figure out who will recommend you and notify them as early as possible. Check the application to see how many recommenders you'll need.","formula":"60"},
  {"field":"StartEssays","fullName":"Start Essays","message":"You should start writing your essays on %DATE%","detail":"Start your essays early. Read and re-read what's required and start to think about how you will answer the essays. Be careful to note the number of essays required.","formula":"60"},
  {"field":"StartPortfolio","fullName":"Start your Portfolio","message":"If you are creating a portfolio, you should start your portfolio on %DATE%","detail":"Give yourself plenty of time to assemble your portfolio. Start early, get advice about your best work from others, and maybe create a few more. By thinking about this early, you'll have time to present your best works. This would also be a good time to check the schools website and find out how the school wants you to submit your works. Usually it's through an online portal. So get familer with this link and how to upload to it.","formula":"60"},
  {"field":"RemindCounselor","fullName":"Remind Counselor","message":"Check in with your counselor by %DATE% and remind them to submit your school forms.","detail":"Counselors are usually very busy humans. Your gentle and kind reminder will help them get their school forms in on time.","formula":"30"},
  {"field":"RemindRecs","fullName":"Remind Recommenders","message":"Check in with your recommenders by %DATE% and remind them to submit your recommendation.","detail":"Recommenders are usually very busy humans. Your gentle and kind reminder will help them get their recommendation in on time.","formula":"30"},
  {"field":"SubmitSnailEssays","fullName":"Submit Snail Essays","message":"If you are sending your essays via regular mail you should send them by %DATE%","detail":"Things happen. Mail gets lost or misplaced. So you want to mail your essays very early to allow time for things to go wrong, just in case you need to mail again.","formula":"30"},
  {"field":"SubmitPortfolio","fullName":"Submit your Portfolio","message":"If you have a portfolio, Submit it by %DATE%","detail":"Your portfolio will probably need to be submitted online. Check schools webpage to find out where and submit your portfolio there.","formula":"30"},
  {"field":"SendSnailSchoolFrm","fullName":"Send Snail School Recommendation","message":"Your counselor should send hard copy (snail mail) school forms by %DATE%","detail":"This is a good safe date for your counselors to send thier school forms if they are mailing them via regular mail (ie not online).","formula":"30"},
  {"field":"SendSnailRec","fullName":"Send Snail Mail Recommendation","message":"Your recommenders should send hard copy (snail mail) recommendations by %DATE%","detail":"This is a good safe date for your recommenders to send their recommendations if they are mailing them via regular mail (ie not online).","formula":"30"},
  {"field":"SubmitOnlineEssays","fullName":"Submit Online Essays","message":"If you are sending your essays online you should send them by %DATE%","detail":"You've been working hard on your essays. %DATE% is the day you should login to your online application system, and press the submit button.","formula":"21"},
  {"field":"SendOnlineSchoolFrm","fullName":"Send Online School Forms","message":"Your couneslor should submit online school forms by %DATE%","detail":"This is a good safe date for your counselor to submit school forms online.","formula":"15"},
  {"field":"SendOnlineRec","fullName":"Send Online Recommendation","message":"Your recommenders should submit online recommendations by %DATE%","detail":"This is a good safe date for your recommenders to submit their recommendations online.","formula":"14"},
  {"field":"SubmissionDate","fullName":"Application Submission Date","message":"%SCHOOL%'s application is due %DATE%","detail":"This is the date that %SCHOOL% needs to have every part of your application; from essays, to recommendations, to SAT scores. If just one item comes in past this date, you are out of the running.","formula":"0"}
]
