[{"__v":0,"_id":"55afe6d706776be011870513","content":"<h1 style=\"text-align: center;\"><span style=\"color: inherit;\">First things first...</span></h1><h2 style=\"text-align: center;\"><span style=\"color: inherit;\"><a href=\"https://youtu.be/1LEcHdAvScw\" target=\"\">Learn how to use YadaGuru and interface with Google Calendar </a></span></h2><h4 style=\"text-align: center;\">(links to youtube: <a href=\"https://youtu.be/1LEcHdAvScw\" target=\"\">https://youtu.be/1LEcHdAvScw</a>)</h4><p><br/></p><h1 style=\"text-align: center;\">All About YadaGuru (our one pager)</h1><h4></h4><h4 style=\"text-align: center;\"><a href=\"https://drive.google.com/file/d/0ByhE21JsXwS-d21GOS1jUWtZS0E/view?usp=sharing\" target=\"\"></a><a href=\"https://drive.google.com/drive/u/1/folders/0ByhE21JsXwS-ZG51Z045ZmxGMUU\" target=\"\"></a><a href=\"https://drive.google.com/file/d/0ByhE21JsXwS-aXQ2azQxajlIVGc/view?usp=sharing\" target=\"\">Here's the PDF One Pager </a><p></p></h4><p><br/></p><h1 style=\"text-align: center;\"><span style=\"color: inherit;\">college application questions</span></h1><div><span style=\"color: inherit;\"><br/></span></div><h2><span style=\"color: inherit;\"><a></a>The college application process really confuses </span><span style=\"color: inherit;\">me!</span><br/></h2><p>You are not alone. Most college-bound students experience degrees of confusion about this process. While YadaGuru will help you organize and remember key dates in the college application process, you're probably also asking questions like:<br/></p><ul><li>How do I choose what school(s) to apply to? <br/></li><li>What should my essay be about? <br/></li><li>Should I apply Early Decision or Early Action? <br/></li><li>How do I set up a college visit? <br/></li><li>What if I don't get into the school I want?<br/></li></ul><div>These are great questions, and Philadelphia students will find some solid answers at <a href=\"http://www.stepuptocollege.org/\">http://www.stepuptocollege.org/</a> and with our friends at <a href=\"http://phillygoestocollege.com/\" target=\"\">PhillyGoes2College</a>.  We also suggest that you watch <a href=\"https://youtu.be/oc7TeAfOyH4\" target=\"\">this video</a> and go through <a href=\"http://www.stepuptocollege.org/images/stepuppptpdf/Step-Up-to-College-Applying-to-College.ppt\">this powerpoint</a> to understand the whole process.</div><div><br/></div><div>One thing we <i>can</i> tell you at YadaGuru is that one of the most important things to do is start your application process <i>early</i>. We suggest utilizing the summer before your senior year of high school to tackle the initial stages of applying to college. If you're a little behind, you'll have to get organized and move more quickly, but you can still find YadaGuru helpful.</div><p></p><p><i>You can do this! Breathe and embrace this crazy and exciting time of your life!</i></p><h2>You said this was only for Regular Decision?  What does that mean?</h2><p>When it comes to applying for college, most schools give a date by which they need all your application materials so that the admissions committees can decide if you should attend their school. <b>A Regular Decision application means that you'll be applying by the latest date the school allows.</b> Some schools allow options for early application. Others are more relaxed about submission dates and will allow you to apply at any time. </p><p>YadaGuru is built around the <b>Regular Decision Process</b>. To learn more about other types of college admissions go to <a href=\"http://www.campusexplorer.com/college-advice-tips/FC3F1C62/College-Admissions-Options-Early-Decision-Early-Action-Rolling-Regular/\" target=\"\">http://www.campusexplorer.com/college-advice-tips/FC3F1C62/College-Admissions-Options-Early-Decision-Early-Action-Rolling-Regular/</a></p><h2>What about Test Scores? What's the best time to take the SAT or the ACT? </h2><p>Some schools will require test scores from the SAT or the ACT, and any AP tests. You'll want to <b>take tests at least three months before the submission date</b>. This is because the College Board needs time to score your test (usually about a month) and then send your scores to the schools of your choice (assume another month).  If you wait to take the test a few months before your application is due, it's possible that the school may not receive your scores from the College Board on time. If that happens, they may not consider you for admission. That's why we advise that you take tests at least three months before your application is due. Keep in mind that College Board does allow you to expedite your test scores, at extra cost to you. </p><h2><span style=\"color: inherit;\">I need financial help to go to college. What is the FAFSA and when do I have to fill it out?</span><br/></h2><p>The <a href=\"https://fafsa.ed.gov/\" target=\"\">Free Application for Federal Student Aid (FAFSA)</a> is an online form used by current and prospective college students in the United States to determine their eligibility for student financial aid. Because of the variation in state and college deadlines, it is highly recommended that you <b>fill out the FAFSA as soon as you can after January 1</b> to ensure that you do not miss out on available aid. The online form must be submitted not later than June 30, but can be corrected or updated in mid-September. Confirm dates for the current year at the FAFSA website. Many states and colleges have earlier deadlines for applying for state and institutional financial aid. You can find your state’s deadline at <a href=\"https://www.fafsa.gov/deadlines\" target=\"\">https://www.fafsa.gov/deadlines</a>. Check with each college about its deadlines.<br/></p><h2>Wow, do all college applications ask a lot of questions? </h2><p>Yes, they usually do! Most basic college applications will ask about: </p><ul><li>basic personal information (including your social security number)</li><li>family/parent information</li><li>your high school(s) address(es)</li><li>senior year classes</li><li>grade point average</li><li>dates of standardized testing (SAT/ACT) </li><li>criminal and behavioral discipline history<br/></li></ul><p></p><p></p><p>All college applications will ask some combination of these items, give or take a few, whether they are online or a printed copy. You should note that the Common and Universal Application allows you to fill out all this basic information once for multiple colleges. Check out the <b>Common Application</b> <a href=\"http://www.commonapplication.org\" target=\"_blank\">here</a>, and<b> Universal Application</b> <a href=\"https://www.universalcollegeapp.com/\" target=\"\">here</a>. <br/><br/></p><h2>I'm an art major and I have to submit a portfolio. How does that work?</h2><p></p><p></p><p><title></title></p><p class=\"p1\">About four months before your school's submission date, you should start assembling your best works.</p><p class=\"p1\">Give yourself plenty of time to assemble your portfolio. Start early, get advice about your best work from others, and maybe create a few more pieces. By thinking about this early, you'll have time to present your best works. This would also be a good time to check the school's website and find out how the school wants you to submit your works. Usually it's through an online portal, like <a href=\"http://www.slideroom.com/\">slideroom.com</a>, so get familiar with this link and how to upload to it.</p><p class=\"p1\">To give you an idea of preparation you'll need, you will probably need to take high quality pictures of your artwork, or scan your work, or upload files, or probably write an artist statement. You might need to find a photographer or a friend who has a good high quality camera, and find a good place with the right lighting to show the highlights of your work.  Don't leave this to a cell phone photo of your work on the dining room table the night before you have to upload it. </p><div><h2>When should I start my Essays? <br/></h2><p>Essays are the most time-consuming parts of the application process, because they require a lot of thinking, writing, and editing. </p><p>Even if an essay is optional, you should still consider taking the time to write one. Essays are a unique opportunity to share with the university something important they should know about you, but will not easily discover by reading the other parts of your application. </p><p>The essay is your chance to answer the questions running through the mind of the admissions counselor:</p><ul><li>What will this student contribute to our community?</li><li>How can we tell this student will be successful here? </li></ul><p></p><p></p><p></p><p>You should start and finish these essays as soon as possible, leaving enough time for proofreading, spellchecking, and feedback by a knowledgeable adult.&#65279;</p><h2>What should I know about Transcripts?</h2><p></p>A 'Transcript' is a copy of all your grades from ninth grade to present. It also has any disciplinary actions that school may have taken, like a suspension. Transcripts are sometimes also called 'Grade Reports' or 'School Reports'. The important thing to remember is that most schools will need you to go to the guidance office and request that the school send your transcript to the colleges and universities you are applying to. </div><div><br/></div><div>Your school has to send the transcript directly to the schools you are applying to. That means a couple of things:</div><p><br/></p><ul><li>You have to go to the guidance office with the addresses of the admissions offices at the colleges you are applying to.</li><li>You will probably have to fill out a form and there may be a fee.</li><li>You will probably have to supply the guidance office with manila envelopes already addressed and stamped to your colleges and universities.</li></ul><div>Additionally, some college and universities will want your transcript throughout your senior year. So they may want a mid-year transcript in December and a final transcript after you've graduated. Obviously, this takes a little bit of forethought, so YadaGuru encourages you to do this very early in the process. YadaGuru will also remind you during the year to check back with your guidance office to ensure the transcripts were sent. Each guidance office has a request process that you should get to know, so stop by the guidance office and get familiar with their policies.</div><div><p><span style=\"color: rgb(85, 85, 85);float: none;background-color: rgb(255, 255, 255);\"></span><br/></p><h2>What should I know about Recommendations?<br/></h2><p>First, most colleges and universities will need to have someone recommend you, which means that this person will have to write a letter about how great you are or fill out a form about how great you are, or both.</p><p>The schools will want your recommender to send the recommendation directly to them, without you seeing it. </p><p>Recommendations can be sent online through Common App or Universal App. They can also be sent through the mail. Read your school's policy and direction on how recommendations should be requested and sent. If the recommendation should be delivered online, then somewhere on the online application, there will be a place for you to invite your recommenders to your application, so that they can login independently and fill out the form and/or write a letter. If the recommendations should be delivered by regular mail, make it easy for your recommender. Print out multiple copies of the form and/or recommendation letter question from the school's application. This allows your recommender to recover if they make a mistake. And then give them envelopes addressed directly to the school, with stamps already attached. </p><p>Second, if you want someone to talk about how great you are, you definitely want to give them lots of time to do so. And usually, you aren't the only person asking them for a recommendation. So we recommend that you politely and gratefully ask your potential recommenders very early in the process. In fact, we ask that you start thinking about who can recommend you the summer before you start working on your application.</p><p>The more time you give yourself and your recommender, the less stress you'll feel.  </p><p>Third, remember that recommenders are human and very busy. So forgive them if they forget your recommendation. Just keep politely reminding them of your need for your recommendation, and keep politely reminding them of the date by which the school needs the recommendation.   </p><p>YadaGuru will help you remember to help them get the recommendations in on time. </p><h2>What are college application fee waivers?<br/></h2><p>You often have to pay the fee before universities will process your application. Sometimes you can't even submit an online application until you pay.</p><p>Before you pay those fees (or start worrying about them), find out if you qualify for that fee to be waived.</p><p>First, call the college's admissions offices to see if they offer any institutional college application fee waivers. Sometimes they have promotions for application times or methods (i.e. applying online) in which they waive the fee. If they don't offer institutional fee waivers, ask them if they accept needs-based fee waivers like NACAC (say &#34;NACK-ack&#34;) or CollegeBoard fee waivers. </p><p>If they say YES, read on.</p><p>Need-based college application fee waivers are available for students who are financially eligible. </p><p><b>COLLEGE BOARD FEE WAIVERS: </b>If you registered for the SAT with a testing-fee waiver, you are eligible for (4) college application-fee waivers; these are available to print out from your CollegeBoard account. They get mailed to the college.</p><div><p><b>NACAC FEE WAIVERS</b>: Ask the guidance counselor at your school if they have NACAC (National Association of College Admissions Counseling) Fee Waivers available. No guidance counselor at your school? You can access the fee waiver here: <a href=\"http://www.nacacnet.org/studentinfo/feewaiver/pages/default.aspx\" target=\"\">http://www.nacacnet.org/studentinfo/feewaiver/pages/default.aspx</a>.</p><p><span><br/></span></p><p><span><br/></span></p><h1 style=\"text-align: center;\"><span>YadaGuru Questions</span></h1><p><span><br/></span></p><h2><span>What does 'YadaGuru' mean?</span><br/></h2><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">'Yada' means 'to Remember' in Hindi. A 'Guru' is an influential teacher or popular expert. 'Yada' also means 'To Know' in Yiddish.</p><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">YadaGuru will be your personal-reminder guru to help you remember everything you have to do to send in your college applications. </p><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\"><br/></p><h2><span>Are these dates accurate? </span><br/></h2><title></title><p class=\"p1\"><span class=\"s1\">The dates on YadaGuru are <i>approximate</i>.  </span></p><p class=\"p1\"><span class=\"s1\"><b>They should be considered to be <i>recommended</i> best dates. You, the student, are ultimately responsible for understanding application dates, and all the pieces of the application. </b></span></p><p class=\"p1\"><span class=\"s1\">Our dates are always best practice dates; meaning that experience has proven that certain time-frames are the best times to successfully begin, check-in, remind, or submit in the application process.<br/></span></p><p class=\"p1\"><span class=\"s1\">Our Advisory Panel is composed of actual high school guidance counselors with years of experience guiding students through the college application process. These counselors have written the reminders and also directed the dates by which the reminder should be sent.</span></p><p class=\"p2\"><span class=\"s1\"></span><br/></p><h2>Do I have to have a Google Calendar account for this to work?</h2><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\"><b>Short Answer</b>: Yes, it helps.</p><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\"><b>Long Answer</b>.  Google calendar is free and it's the easiest way to configure reminders.  If you have a smart phone, you can sync your Google calendar with your smart phone calendar.  You can also download the Google calendar app.  Either way, the beauty of Google calendar is that<i> you can tell it when to remind you about dates.</i>  You could choose to get reminded on the day of, or a week before, or 30 minutes before or something custom.  And you can set it up to text you, email you or just pop up a reminder on your phone or computer.  </p><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">You can use YadaGuru without Google calendar.  There's a <i>download iCal</i> button that downloads a universal iCal format (*.ics) that can work in any calendar program.  You might do this so that you can upload the *.ics file to Outlook for example. There's a &#34;S<i>ave PDF&#34; </i>button as well.  This enables you to download a PDF file that you can then print, or save on your phone, record on a printed calendar, or send to your mom etc. </p><h2 style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">How does YadaGuru help me?</h2><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">YadaGuru helps you deliver college applications completely and on time. </p><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">In the college application world, lots of advice is available about the<span class=\"Apple-converted-space\"> </span><i>content<span class=\"Apple-converted-space\"> </span></i>of an application; how to write essays, what to include in your extra curricular activities, who to ask to recommend you. But even students who have all the right content can fail on the logistics of delivering a complete application on time.</p><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">YadaGuru’s niche is that it focuses on the mechanics of delivery. YadaGuru provides a set of reminders based on best practices from guidance counselors about when to perform each step of the college application process, from signing-in to online application portals, to asking someone to write a letter of recommendation for you, to registering for the SAT, to remembering to hit the submit button.</p><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">Content preparation is up to the student, but YadaGuru is a key tool for ensuring delivery of all materials to the school on time.</p><h3>Supporting Data</h3><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">Brookings Institution &#34;..demonstrated that the majority of high-achieving, low-income students do not apply to any selective colleges despite apparently being well qualified for admission&#34; and suggest that targeted information, like YadaGuru, can encourage more successful applications.  Check out thier <a href=\"http://www.brookings.edu/~/media/projects/bpea/spring-2013/2013a_hoxby.pdf\" target=\"\">full study. </a> </p><h2 style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">Give me an Example </h2><h5 style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">LIMITED SUPPORT TO LEARN HOW TO SUBMIT A COLLEGE APPLICATION</h5><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">Anthony is a high school junior. It’s August and he’s thinking of applying to college next year. He goes to a Philadelphia public school. His cousin went to college but is busy working and doesn’t have a lot of time to help him with the application process. There are two guidance counselors for 1500 kids at his school, so it’s hard to get their time. Anthony’s mom works nights at a hospital and can’t make some of the college-prep meetings at school so he knows that if he wants to go to college he’s got to figure it out on his own. He’s visited one of the Philly Goes to College hotspots and talked to the counselor there. While there he got a stack of information about how to be a good candidate; what kind of essays to write, and identified his extra-curricular activities that he needs to talk about in his application.</p><h5 style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">NOT JUST CONTENT, BUT SUCCESSFUL APPLICATION DELIVERY</h5><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">With YadaGuru, the counselor at the hotspot could also give him the<span class=\"Apple-converted-space\"> </span><i>dates<span class=\"Apple-converted-space\"> </span></i>by which he would need to get everything to the school on time. So not only would the content of his application be great,<span class=\"Apple-converted-space\"> </span><i><b><b>but his delivery would be successful</b></b></i>. Together they could review<span class=\"Apple-converted-space\"> </span><i>the dates by which he needs to begin<span class=\"Apple-converted-space\"> </span></i>to get everything done. Then Anthony can push the reminders to his Google calendar so that he can be reminded not just of when something is due, but more importantly, when he needs to start working on something to get it done in time and to the school by the due date.</p><h5 style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">BUILDING A COMMUNITY OF SUPPORT WITH KNOWLEDGE OF SUCCESSFUL APPLICATION DELIVERY</h5><p style=\"color: rgb(85, 85, 85);background-color: rgb(255, 255, 255);\">Anthony’s pastor is also very involved in supporting him. Pastor Charles has gone to YadaGuru and printed out the list of reminders so he makes sure to ask Anthony about his next steps every time he sees him at church on Sunday.</p><h2><br/></h2><h2>I know YadaGuru is meant for the Philadelphia area, but we'd like to use it in our school district. How can we adapt it for our school district?</h2><p>As long as you follow the license policy, you are free to<a href=\"https://github.com/yadaguru/yadaguru-app\" target=\"\" style=\"background-color: rgb(255, 255, 255);\"> get the code from GitHub</a>, host the software on your own site and modify as you will. This would be a great project for a code class. </p><h2>I'm a developer, are you covered by any software licenses?</h2><p>(i.e, the &#34;License Policy&#34;)</p><p>Yadadguru is covered by two licenses:</p><p><a href=\"http://www.gnu.org/licenses/gpl.html\" target=\"\">The GNU General Public License</a>, with the exception that under section 4 we allow no price to be charged for any copies of this application.</p><p><a href=\"https://creativecommons.org/licenses/by-nc-sa/4.0/\" target=\"\">The Creative Commons BY-NC-SA license </a></p><p><br/></p><h2>Feedback</h2><p>Got Feedback for us?  Email us at <a href=\"mailto:comms@codeforphilly.flowdock.com\" target=\"\">comms@codeforphilly.flowdock.com</a>.  Wanna keep in touch? <a href=\"https://twitter.com/yadaguru\" target=\"\">Follow us on Twitter</a>.</p><p><br/></p><p><br/></p><p><br/></p><p><br/></p><p></p><p></p></div></div>","links":{"self":"http://yadaguru.com/api/faqs/55afe6d706776be011870513"}}]
